; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Warehouse
;
; By: Ryan Xiao Wang, 2024
; License: MIT
;
; The aim is to move remove exactly the boxes that are marked for removal.
; Boxes start on stacks of blocks that are located on a fixed number of bases,
; and can be moved between stacks and bases. Boxes can be removed from the
; stacks and bases they are on when they are the top box.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain warehouse)
    (:requirements :strips :typing :equality)
    (:types box base) 
    (:predicates 
        (on ?b1 - box ?b2 - box)
        (on-base ?b - box ?base - base)
        (clear ?b - box)
        (clear-base ?b - base)
        (to-remove ?b - box)
        (removed ?b - box)
    )

    (:action move
        :parameters (?b ?old-under ?new-under - box)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-to-new-base
        :parameters (?b ?old-under - box ?new-base - base)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear-base ?new-base)
        )
        :effect (and 
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-from-base
        :parameters (?b - box ?base - base ?new-under - box)
        :precondition (and
            (clear ?b)
            (on-base ?b ?base)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear-base ?base)
            (not (on-base ?b ?base))
        )
    )

    (:action move-between-base
        :parameters (?b - box ?old-base ?new-base - base)
        :precondition (and
            (clear ?b)
            (on-base ?b ?old-base)
            (clear-base ?new-base)
        )
        :effect (and
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear-base ?old-base)
            (not (on-base ?b ?old-base))
        )
    )

    (:action remove
        :parameters (?b ?under - box)
        :precondition (and
            (to-remove ?b)
            (on ?b ?under)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear ?under)
            (not (on ?b ?under))
            (not (clear ?b))
        )
    )

    (:action remove-from-base
        :parameters (?b - box ?base - base)
        :precondition (and
            (to-remove ?b)
            (on-base ?b ?base)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear-base ?base)
            (not (on-base ?b ?base))
            (not (clear ?b))
        )
    )
)

; problem
;; boxes=94, remove_proportion=0.101, bases=37, instance_id=29, output=./training, seed=70

(define (problem warehouse-29)
    (:domain warehouse)
    (:objects
        box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 box24 box25 box26 box27 box28 box29 box30 box31 box32 box33 box34 box35 box36 box37 box38 box39 box40 box41 box42 box43 box44 box45 box46 box47 box48 box49 box50 box51 box52 box53 box54 box55 box56 box57 box58 box59 box60 box61 box62 box63 box64 box65 box66 box67 box68 box69 box70 box71 box72 box73 box74 box75 box76 box77 box78 box79 box80 box81 box82 box83 box84 box85 box86 box87 box88 box89 box90 box91 box92 box93 box94 - box
        base1 base2 base3 base4 base5 base6 base7 base8 base9 base10 base11 base12 base13 base14 base15 base16 base17 base18 base19 base20 base21 base22 base23 base24 base25 base26 base27 base28 base29 base30 base31 base32 base33 base34 base35 base36 base37 - base
    )
    (:init
        (to-remove box14)
        (to-remove box16)
        (to-remove box18)
        (to-remove box20)
        (to-remove box38)
        (to-remove box42)
        (to-remove box58)
        (to-remove box59)
        (to-remove box90)
        (clear-base base1)
        (clear box19)
        (on box19 box89)
        (on-base box89 base2)
        (clear box82)
        (on box82 box33)
        (on box33 box88)
        (on box88 box14)
        (on-base box14 base3)
        (clear box60)
        (on box60 box30)
        (on box30 box66)
        (on box66 box85)
        (on box85 box61)
        (on-base box61 base4)
        (clear box70)
        (on box70 box6)
        (on box6 box41)
        (on box41 box24)
        (on box24 box73)
        (on-base box73 base5)
        (clear box55)
        (on box55 box58)
        (on box58 box13)
        (on box13 box29)
        (on-base box29 base6)
        (clear box44)
        (on box44 box52)
        (on box52 box12)
        (on box12 box86)
        (on-base box86 base7)
        (clear box22)
        (on box22 box57)
        (on box57 box37)
        (on box37 box64)
        (on-base box64 base8)
        (clear box69)
        (on box69 box18)
        (on box18 box25)
        (on-base box25 base9)
        (clear box51)
        (on box51 box39)
        (on box39 box35)
        (on box35 box78)
        (on box78 box45)
        (on-base box45 base10)
        (clear-base base11)
        (clear box56)
        (on-base box56 base12)
        (clear box38)
        (on box38 box74)
        (on-base box74 base13)
        (clear box62)
        (on box62 box1)
        (on-base box1 base14)
        (clear box28)
        (on-base box28 base15)
        (clear box4)
        (on box4 box94)
        (on box94 box91)
        (on-base box91 base16)
        (clear box20)
        (on box20 box65)
        (on box65 box80)
        (on box80 box63)
        (on-base box63 base17)
        (clear box48)
        (on box48 box9)
        (on box9 box53)
        (on-base box53 base18)
        (clear box72)
        (on box72 box17)
        (on box17 box42)
        (on-base box42 base19)
        (clear box34)
        (on-base box34 base20)
        (clear box92)
        (on box92 box8)
        (on box8 box76)
        (on-base box76 base21)
        (clear-base base22)
        (clear box16)
        (on box16 box54)
        (on box54 box81)
        (on box81 box26)
        (on box26 box36)
        (on-base box36 base23)
        (clear box84)
        (on-base box84 base24)
        (clear box3)
        (on box3 box10)
        (on-base box10 base25)
        (clear box43)
        (on box43 box32)
        (on box32 box75)
        (on box75 box5)
        (on-base box5 base26)
        (clear box90)
        (on box90 box2)
        (on box2 box93)
        (on-base box93 base27)
        (clear box47)
        (on box47 box68)
        (on-base box68 base28)
        (clear box21)
        (on box21 box11)
        (on-base box11 base29)
        (clear box71)
        (on box71 box59)
        (on-base box59 base30)
        (clear-base base31)
        (clear box23)
        (on box23 box46)
        (on box46 box15)
        (on-base box15 base32)
        (clear box50)
        (on box50 box77)
        (on box77 box7)
        (on-base box7 base33)
        (clear box79)
        (on box79 box83)
        (on box83 box31)
        (on-base box31 base34)
        (clear box87)
        (on box87 box40)
        (on box40 box49)
        (on box49 box27)
        (on-base box27 base35)
        (clear-base base36)
        (clear box67)
        (on-base box67 base37)
    )
    (:goal (and 
        (removed box14)
        (removed box16)
        (removed box18)
        (removed box20)
        (removed box38)
        (removed box42)
        (removed box58)
        (removed box59)
        (removed box90)
    ))
)

; plan
1. (remove box16 box54)
   deleted: (on box16 box54) (clear box16)
   added: (removed box16) (clear box54)
   goals met: 1 of 9
2. (move box55 box58 box19)
   deleted: (clear box19) (on box55 box58)
   added: (on box55 box19) (clear box58)
   goals met: 1 of 9
3. (remove box20 box65)
   deleted: (on box20 box65) (clear box20)
   added: (removed box20) (clear box65)
   goals met: 2 of 9
4. (move box69 box18 box21)
   deleted: (clear box21) (on box69 box18)
   added: (on box69 box21) (clear box18)
   goals met: 2 of 9
5. (remove box18 box25)
   deleted: (on box18 box25) (clear box18)
   added: (removed box18) (clear box25)
   goals met: 3 of 9
6. (move box71 box59 box22)
   deleted: (clear box22) (on box71 box59)
   added: (on box71 box22) (clear box59)
   goals met: 3 of 9
7. (move box72 box17 box23)
   deleted: (clear box23) (on box72 box17)
   added: (on box72 box23) (clear box17)
   goals met: 3 of 9
8. (move box17 box42 box25)
   deleted: (clear box25) (on box17 box42)
   added: (on box17 box25) (clear box42)
   goals met: 3 of 9
9. (move box82 box33 box17)
   deleted: (clear box17) (on box82 box33)
   added: (on box82 box17) (clear box33)
   goals met: 3 of 9
10. (move box33 box88 box28)
   deleted: (clear box28) (on box33 box88)
   added: (on box33 box28) (clear box88)
   goals met: 3 of 9
11. (move box88 box14 box3)
   deleted: (clear box3) (on box88 box14)
   added: (on box88 box3) (clear box14)
   goals met: 3 of 9
12. (remove-from-base box14 base3)
   deleted: (on-base box14 base3) (clear box14)
   added: (removed box14) (clear-base base3)
   goals met: 4 of 9
13. (remove box38 box74)
   deleted: (on box38 box74) (clear box38)
   added: (removed box38) (clear box74)
   goals met: 5 of 9
14. (remove-from-base box42 base19)
   deleted: (on-base box42 base19) (clear box42)
   added: (removed box42) (clear-base base19)
   goals met: 6 of 9
15. (remove box58 box13)
   deleted: (on box58 box13) (clear box58)
   added: (removed box58) (clear box13)
   goals met: 7 of 9
16. (remove-from-base box59 base30)
   deleted: (on-base box59 base30) (clear box59)
   added: (removed box59) (clear-base base30)
   goals met: 8 of 9
17. (remove box90 box2)
   deleted: (on box90 box2) (clear box90)
   added: (removed box90) (clear box2)
   goals met: 9 of 9
